Repository: iSOLveIT/aprdocumentation
Catalog: docs/usermanuals/locale/*/LC_MESSAGES/monitor/openpredictivedashboard.po
Languages: de

source: Open predictive dashboard
de: Öffnen Sie das Vorhersage-Dashboard

source: Apromore’s predictive monitoring plugins are available as add-ons to Apromore Enterprise Edition.
de: Die Predictive-Monitoring-Plugins von Apromore sind als Add-Ons für verfügbar Apromore Enterprise Edition.

source: Once the predictive models have been trained, they can be deployed to the Runtime predictive monitoring environment of Apromore, to make predictions on ongoing cases. The Runtime plugin bundle can be used to stream an event log from the repository, or hook into an external stream. Either way, the input stream is transformed into a stream of predictions which is visualized in a Web-based dashboard.
de: Sobald die Vorhersagemodelle trainiert wurden, können sie für die bereitgestellt werden Runtime Predictive Monitoring Umgebung von Apromore, zu machen prognosen zu laufenden Fällen. Dazu kann das Runtime-Plugin-Bundle verwendet werden streamen Sie ein Ereignisprotokoll aus dem Repository oder hängen Sie sich in einen externen Stream ein. In beiden Fällen wird der Eingabestrom in einen Strom von Vorhersagen umgewandelt die in einem webbasierten Dashboard visualisiert wird.

source: To use the plugin, select an event log from the repository and click on *Monitor -> Predictively monitor log*. For demonstration purposes, Apromore repository provides several pre-processed logs under Examples/Predictive Monitoring folder. These logs can also be downloaded from `here <https://drive.google.com/file/d/1ZATjpBMSjgxLDKdIvLOJ15NRz_N0b6K0/view>`_
de: Um das Plugin zu verwenden, wählen Sie ein Ereignisprotokoll aus dem Repository aus und klicken Sie auf *Überwachen -> Protokoll vorausschauend überwachen*. Zu Demonstrationszwecken, Das Apromore-Repository bietet mehrere vorverarbeitete Protokolle unter Ordner Beispiele/Predictive Monitoring. Diese Protokolle können auch heruntergeladen werden von `hier <https://drive.google.com/file/d/1ZATjpBMSjgxLDKdIvLOJ15NRz_N0b6K0/view>`_

source: image1
de: Bild1

source: Create a new Predictive Monitor.
de: Erstellen Sie einen neuen Predictive Monitor.

source: image2
de: Bild2

source: Select the created monitor and click *Stream log to dataflow*.
de: Wählen Sie den erstellten Monitor aus und klicken Sie auf *Stream log to dataflow*.

source: image3
de: Bild3

source: Click *Show dashboard* to start streaming events from the log. A dashboard will show up and populate with ongoing cases:
de: Klicken Sie auf *Dashboard anzeigen*, um mit dem Streamen von Ereignissen aus dem Protokoll zu beginnen. EIN dashboard wird angezeigt und mit laufenden Fällen gefüllt:

source: image4
de: Bild4

source: The dashboard provides a list of currently ongoing as well as completed cases. For each case, it is also possible to visualize a range of summary statistics including the number of events in the case, its starting time and the time when the latest event in the case has occurred. For the ongoing cases, the Runtime plugin bundle provides the predicted values of the performance indicators the user wants to predict. For completed cases, instead, it shows the actual values of the indicators. Color-coding is applied to help users quickly nail down potentially problematic cases.
de: Das Dashboard bietet eine Liste der derzeit laufenden sowie abgeschlossenen Fälle. Für jeden Fall ist es auch möglich, eine Reihe von Zusammenfassungen zu visualisieren Statistiken, einschließlich der Anzahl der Ereignisse im Fall, seiner Startzeit und den Zeitpunkt, zu dem das letzte Ereignis in dem Fall eingetreten ist. Für die In laufenden Fällen liefert das Runtime-Plug-in-Bundle die vorhergesagten Werte von die Leistungsindikatoren, die der Benutzer vorhersagen möchte. Für abgeschlossen Fällen zeigt es stattdessen die tatsächlichen Werte der Indikatoren. Farbe-Codierung wird angewendet, um Benutzern dabei zu helfen, potenzielle Probleme schnell einzugrenzen Fälle.

source: Export performance predictions into CSV
de: Leistungsvorhersagen in CSV exportieren

source: In addition to the dashboard for continuous real-time process monitoring, the Runtime plugin supports a *regular reports* use case where users can get reports in a CSV format on a regular basis with the current set of predictions. These reports can be readily imported into common data analytics platforms (e.g. Microsoft Excel, Tableau, QlikView, R) for further exploration and visualization.
de: Neben dem Dashboard zur kontinuierlichen Prozessüberwachung in Echtzeit, Das Runtime-Plug-in unterstützt einen Anwendungsfall für *reguläre Berichte*, in dem Benutzer dies können Erhalten Sie regelmäßig Berichte im CSV-Format mit dem aktuellen Satz von Vorhersagen. Diese Berichte können problemlos in gemeinsame Daten importiert werden Analyseplattformen (z. B. Microsoft Excel, Tableau, QlikView, R) für weitere Erforschung und Visualisierung.

source: image5
de: Bild5

source: A screencast of this plugin can be found `here <https://www.youtube.com/watch?v=Q4WVebqJzUI&feature=youtu.be>`_ .
de: Einen Screencast dieses Plugins finden Sie `hier <https://www.youtube.com/watch?v=Q4WVebqJzUI&feature=youtu.be>`_ .
